app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "タイトル"], ["body", "本文"], ["created_at", "2020-03-23 04:59:27.022365"], ["updated_at", "2020-03-23 04:59:27.022365"]]
---
  def create
      # ↓ストロングパラメーターを使用
      list = List.new(list_params)
      # ↓DBへ保存する
      list.save